#+TITLE: Emacs literate configuration
#+AUTHOR: Sebastian Halbig
#+DATE: 04/2022
#+STARTUP: show2levels indent hidestars
#+PROPERTY: header-args :tangle (let ((org-use-tag-inheritance t)) (if (member "INACTIVE" (org-get-tags))  "no" "~/.emacs.d/init.el")))

*** Sidebar :BINDING:

This defines an org sidebar using imenu-list.

#+name: my-org-sidebar
#+begin_src emacs-lisp

(require 'imenu)
(require 'imenu-list)

(defun my-org-tree-to-indirect-buffer ()
  "Create indirect buffer, narrow it to current subtree and unfold blocks"

  (org-tree-to-indirect-buffer)
  (org-show-block-all)
  (setq-local my-org-blocks-hidden nil))

(defun my-org-sidebar ()
  "Open an imenu list on the left that allow navigation."

  (interactive)
  (setq imenu-list-after-jump-hook #'my-org-tree-to-indirect-buffer
        imenu-list-position 'left
        imenu-list-size 36
        imenu-list-focus-after-activation t)

  (let ((heading (substring-no-properties (or (org-get-heading t t t t) ""))))
    (when (buffer-base-buffer)
      (switch-to-buffer (buffer-base-buffer)))
    (imenu-list-minor-mode)
    (imenu-list-stop-timer)
    (hl-line-mode)
    (face-remap-add-relative 'hl-line :inherit 'nano-subtle)
    (setq header-line-format
          '(:eval
            (nano-modeline-render nil
                                  (buffer-name imenu-list--displayed-buffer)
                                  "(outline)"
                                  "")))
    (setq-local cursor-type nil)
    (when (> (length heading) 0)
      (goto-char (point-min))
      (search-forward heading)
      (imenu-list-display-dwim))))

#+end_src

#+RESULTS: my-org-sidebar
: my-org-sidebar

This toggles the org-sidebar.

#+name: org-sidebar-toggle
#+begin_src emacs-lisp

(defun my-org-sidebar-toggle ()
  "Toggle the org-sidebar"

  (interactive)
  (if (get-buffer-window "*Ilist*")
      (progn
        (quit-window nil (get-buffer-window "*Ilist*"))
        (switch-to-buffer (buffer-base-buffer)))
    (my-org-sidebar)))

#+end_src

#+RESULTS: org-sidebar-toggle
: my-org-sidebar-toggle

Make sure tangle is applied to the base buffer and not the subtree.

#+name: my-org-babel-tangle
#+begin_src emacs-lisp

(defun my-org-babel-tangle ()
  "Write code blocks to source-specific files from the base buffer."

  (interactive)
  (with-current-buffer (or (buffer-base-buffer)
                           (current-buffer))
    (org-babel-tangle)))

#+end_src

#+RESULTS: my-org-babel-tangle
: my-org-babel-tangle


Toggle code blocks folding, starting folded.

#+name: my-org-toggle-blocks
#+begin_src emacs-lisp

(defvar my-org-blocks-hidden nil)

(defun my-org-toggle-blocks ()
  "Toggle code blocks folding."

  (interactive)
  (if my-org-blocks-hidden
      (org-show-block-all)
    (org-hide-block-all))
  (setq-local my-org-blocks-hidden (not my-org-blocks-hidden)))

(add-hook 'config-mode-hook #'my-org-toggle-blocks)

#+end_src

#+RESULTS: my-org-toggle-blocks
| my-org-toggle-blocks |


#+begin_src emacs-lisp

(defvar my-imenu-list-folding-status t
  "Folding status of the imenu-list")

(defun my-imenu-list-toggle-folding ()
  "Toggle top level nodes of the imenu-list buffer"

  (interactive)
  (with-current-buffer "*Ilist*"
    (save-excursion
      (goto-char (point-min))
      (while (re-search-forward "^\\+ " nil t)
        (if my-imenu-list-folding-status
            (hs-hide-block)
          (hs-show-block)))
      (setq my-imenu-list-folding-status (not my-imenu-list-folding-status)))))

(bind-key "S-<tab>" #'my-imenu-list-toggle-folding imenu-list-major-mode-map)

#+end_src

#+RESULTS:
: my-imenu-list-toggle-folding

Some information for when a top node is closed

#+begin_src emacs-lisp

(defun my-display-code-line-counts (ov)
  (when (eq 'code (overlay-get ov 'hs))
    (overlay-put ov 'display
                 (propertize
                  (format " [%d sections] … "
                          (- (count-lines (overlay-start ov)
                                          (overlay-end ov)) 1))
                  'face 'nano-faded))))

(setq hs-set-up-overlay #'my-display-code-line-counts)

#+end_src

#+RESULTS:
: my-display-code-line-counts

#+begin_src emacs-lisp

(defun my-imenu-list-display-dwim ()
  "Display or toggle the entry at `point'."
  (interactive)
  (save-selected-window
    (save-excursion
      (my-imenu-list-ret-dwim))))

(defun my-imenu-list-ret-dwim ()
  "Jump to or toggle the entry at `point'."
  (interactive)
  (save-excursion
    (let ((entry (imenu-list--find-entry)))
      (when (imenu--subalist-p entry)
        (setq entry (cons
                     (car entry)
                     (get-text-property 0 'marker (car entry)))))
      (imenu-list--goto-entry entry))))

(bind-key "<SPC>" #'my-imenu-list-display-dwim imenu-list-major-mode-map)
(bind-key "<return>" #'my-imenu-list-ret-dwim imenu-list-major-mode-map)

#+end_src

#+RESULTS:
: my-imenu-list-ret-dwim

*** Filter :BINDING:

This provide the ~my-org-imenu-filter~ that allow to filter sidebar entries using the specified expression (e.g. "+HOOK +DEFER").

#+begin_src emacs-lisp

(bind-key "C-c f" #'my-org-imenu-filter)
(bind-key "f" #'my-org-imenu-filter imenu-list-major-mode-map)
(bind-key "U" #'imenu-list-refresh imenu-list-major-mode-map)

#+end_src

#+RESULTS:
: imenu-list-refresh

3 levels for org-imenu

#+begin_src emacs-lisp

(setq org-imenu-depth 3)

#+end_src

#+RESULTS:
: 3


#+begin_src emacs-lisp

(require 'svg-tag-mode)

(defvar my-org-imenu-filter-history
  '("BINDING" "HOOK" "ADVICE" "FACE" "MODE" "DEFER"
    "PERSONAL" "INACTIVE" "BUGFIX" "OTHER" "TIMER" "OS")
  "Filter history list.")

(with-eval-after-load 'org
  (defvar my-org-imenu-filter-function
    (cdr (org-make-tags-matcher "*"))
    "Filter function to decide if a headline is kept"))

(defun my-org-imenu-filter ()
  "Define and apply a new filter"

  (interactive)
  (let* ((match (completing-read-multiple
                 "FILTER: "
                 my-org-imenu-filter-history
                 nil nil nil
                 'my-org-imenu-filter-history))
         (match (mapconcat #'identity match " ")))
    (when (string= "" match)
      (setq match "*"))
    (setq my-org-imenu-filter-function
          (cdr (org-make-tags-matcher match)))
    (imenu-list-refresh)))


(defun my-org-imenu-filter-tree (&optional bound parent-match)
  "Build a imenu list using current filter function"

  (let* ((headlines '()))
    (save-excursion
      (org-with-wide-buffer
       (unless bound
         (setq bound (point-max))
         (goto-char (point-min)))
       (while (re-search-forward org-heading-regexp bound t)
         (let* ((element (org-element-at-point))
                (begin (org-element-property :begin element))
                (end (org-element-property :end element))
                (marker (copy-marker begin))
                (level (org-element-property :level element))
                (tags (save-excursion
                        (goto-char begin)
                        (org-get-tags)))
                (match (save-excursion
                         (goto-char begin)
                         (funcall my-org-imenu-filter-function
                                  nil (org-get-tags) level)))

                (title (org-element-property :raw-value element))
                (title (org-link-display-format
                        (substring-no-properties title)))
                (title (propertize title 'org-imenu-marker marker
                                   'org-imenu t))
                (title (if (member "INACTIVE" tags)
                           (propertize title 'face 'nano-faded)
                         title))
                (svg-tags (mapconcat #'(lambda (tag)
                                         (propertize tag 'display (svg-tag-make tag :face 'nano-faded)))
                                     tags " "))
                (title (if tags (format "%s %s" title svg-tags) title))
                (title (propertize title 'marker marker))
                (children (my-org-imenu-filter-tree end match)))
           (goto-char end)

           (cond ((> level org-imenu-depth)
                  nil)
                 ((> (length children) 0)
                  (add-to-list 'headlines (append (list title) children) t))
                 ((or match parent-match)
                  (add-to-list 'headlines (cons title marker) t)))))))
    headlines))

(advice-add #'org-imenu-get-tree :override #'my-org-imenu-filter-tree)

#+end_src

#+RESULTS:

*** Configuration mode

This section defines the ~my-config-mode~ to ease navigating and interacting with the configuration file.

Navigation commands using the ilist menu.

#+begin_src emacs-lisp

(defun my-config-mode-prev-header ()
  "Move to previous header"

  (interactive)
  (with-current-buffer "*Ilist*"
    (search-backward-regexp "^  ")
    (imenu-list-display-dwim)))

(defun my-config-mode-next-header ()
  "Move to next header"

  (interactive)
  (with-current-buffer "*Ilist*"
    (forward-line)
    (search-forward-regexp "^  ")
    (imenu-list-display-dwim)))

(defun my-config-mode-prev-section ()
  "Move to previous section"

  (interactive)
  (with-current-buffer "*Ilist*"
    (search-backward-regexp "\\+ " nil nil 2)
    (forward-line)
    (imenu-list-display-dwim)))

(defun my-config-mode-next-section ()
  "Move to next section"

  (interactive)
  (with-current-buffer "*Ilist*"
    (previous-line)
    (search-forward-regexp "\\+ ")
    (forward-line)
    (imenu-list-display-dwim)))

#+end_src

#+RESULTS:
: my-config-mode-next-section

A minor mode for configuration

#+name: config-mode
#+begin_src emacs-lisp

(define-minor-mode my-config-mode
  "Configuration mode"

  :init-value nil
  :global nil
  :keymap (let* ((map (make-sparse-keymap)))
            (bind-key "C-c C-p"   #'my-config-mode-prev-header map)
            (bind-key "C-c C-n"   #'my-config-mode-next-header map)
            (bind-key "C-c C-S-p" #'my-config-mode-prev-section map)
            (bind-key "C-c C-S-n" #'my-config-mode-next-section map)
            (bind-key "C-`"       #'my-org-sidebar-toggle map)
            (bind-key "C-c C-v t" #'my-org-babel-tangle map)
            (bind-key "C-c t"     #'my-org-toggle-blocks map)
            map)

  (require 'org)
  (if my-config-mode
      (my-org-sidebar)))


#+end_src

#+RESULTS: config-mode
| my-config-mode         | keymap | (67108960 . my-org-sidebar-toggle)                                                                                                    | (3 keymap (116 . my-org-toggle-blocks) (22 keymap (116 . my-org-babel-tangle)) (33554446 . my-config-mode-next-section) (33554448 . my-config-mode-prev-section) (14 . my-config-mode-next-header) (16 . my-config-mode-prev-header)) |
| vc-dir-git-mode        | keymap | (122 keymap (112 . vc-git-stash-pop) (115 . vc-git-stash-snapshot) (99 . vc-git-stash))                                               |                                                                                                                                       |
| diff-minor-mode        | keymap | (3 keymap (61 keymap (remap keymap (undo . diff-undo)) (82 . diff-reverse-direction) (114 . diff-restrict-view) (65 . diff-ediff-patch) (111 . diff-goto-source) (87 . widen) (mouse-2 . diff-goto-source) (13 . diff-goto-source) (123 . diff-file-prev) (125 . diff-file-next) (75 . diff-file-kill) (107 . diff-hunk-kill) (backtab . diff-hunk-prev) (9 . diff-hunk-next) (80 . diff-file-prev) (112 . diff-hunk-prev) (78 . diff-file-next) (110 . diff-hunk-next) keymap (103 . revert-buffer) (60 . beginning-of-buffer) (62 . end-of-buffer) (104 . describe-mode) (63 . describe-mode) (127 . scroll-down-command) (33554464 . scroll-down-command) (32 . scroll-up-command) (113 . quit-window) (57 . digit-argument) (56 . digit-argument) (55 . digit-argument) (54 . digit-argument) (53 . digit-argument) (52 . digit-argument) (51 . digit-argument) (50 . digit-argument) (49 . digit-argument) (48 . digit-argument) (45 . negative-argument) (remap keymap (self-insert-command . undefined)))) |                                                                                                                                       |
| gnus-dead-summary-mode | keymap | #^[nil nil keymap                                                                                                                     |                                                                                                                                       |

A shortcut to edit configuration

#+begin_src emacs-lisp :prologue "" :epilogue ""
(defun my-config ()
  "Create a new for editing configuration"

  (interactive)
  (select-frame (make-frame '((name . "my-config")
                              (width . 150)
                              (height . 45))))
  (find-file "~/Documents/GitHub/dotemacs/dotemacs.org")
  (my-config-mode))

#+end_src

#+RESULTS:
: my-config

An autoload function for my-config (that will load org mode).

#+begin_src emacs-lisp :prologue "" :epilogue ""

(autoload 'my-config
  (expand-file-name "init.el" user-emacs-directory)
  "Autoloaded my-config command."
  t)

#+end_src

#+RESULTS:

*** Auto-tangle

Automatically tangle org-mode files with the option #+auto_tangle: t

#+begin_src emacs-lisp

(add-hook 'org-mode-hook 'org-auto-tangle-mode)

#+end_src

#+RESULTS:
| org-auto-tangle-mode | org-tempo-setup | my-org-mode-hook | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-fold-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] |

